🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / aws-ec2 ](https://app.env0.com/p/31b6d0ce-6ca1-4a99-b677-830205efa211/environments/0beb8764-aef4-4aea-8e55-9af12c58cffd):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # aws_instance.ec2_instance will be created
+   resource "aws_instance" "ec2_instance" {
+       ami                                  = "ami-07c589821f2b353aa"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.medium"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "subnet-01136e2eaaa0cfcb5"
+       tags                                 = {
+           "Name" = "EC2 Instance"
        }
+       tags_all                             = {
+           "Name" = "EC2 Instance"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = [
+           "sg-06ec672f8d33c1464",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   public_ip = (known after apply)
```
</details>


```
Monthly cost change for pengjiang80/aws-ec2/env0_tf_plan.json
Amount:  +$45 ($0.00 → $45)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
──────────────────────────────────
Project: pengjiang80/aws-ec2/env0_tf_plan.json

+ aws_instance.ec2_instance
  +$45

+     Instance usage (Linux/UNIX, on-demand, t2.medium)
      +$44

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.96

Monthly cost change for pengjiang80/aws-ec2/env0_tf_plan.json
Amount:  +$45 ($0.00 → $45)

──────────────────────────────────
Key: ~ changed, + added, - removed

1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

Infracost estimate: Monthly cost will increase by $45 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━┓
┃ Project                                            ┃ Cost change ┃ New monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━━━━┫
┃ pengjiang80/aws-ec2/env0_tf_plan.json              ┃        +$45 ┃ $45              ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━━━━┛
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/31b6d0ce-6ca1-4a99-b677-830205efa211/environments/0beb8764-aef4-4aea-8e55-9af12c58cffd/deployments/0cb47099-d8c1-4d4b-b114-0293931f75e9)